---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Entity.Dispose
source: html/6bc9f086-909b-29e4-d767-816d63b79521.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.Dispose Method

Releases all resources used by the Entity

## Syntax (C#)
```csharp
public void Dispose()
```